>>> opening /dev/fortytwo in mode 2
> reading 5 bytes
read: salec
actual bytes read: 5

>>> opening /dev/fortytwo in mode 2
> reading 3 bytes
read: sal
actual bytes read: 3

> reading 2 bytes
read: ec
actual bytes read: 2

> reading 10 bytes
read: 
actual bytes read: 0

>>> opening /dev/fortytwo in mode 2
> reading 24 bytes
read: salec
actual bytes read: 5

> writing `salec`
successfully wrote 5 bytes

> writing `sales`
errno: 22 Invalid argument

> writing `sale`
errno: 22 Invalid argument

> writing `salec42`
errno: 22 Invalid argument

