----------------------------------------------------------------------
>>>>> Testing /sys/kernel/debug/fortytwo/id
>>> opening /sys/kernel/debug/fortytwo/id in mode 2
> reading 5 bytes
read: salec
actual bytes read: 5

>>> opening /sys/kernel/debug/fortytwo/id in mode 2
> reading 3 bytes
read: sal
actual bytes read: 3

> reading 2 bytes
read: ec
actual bytes read: 2

> reading 10 bytes
read:
actual bytes read: 0

>>> opening /sys/kernel/debug/fortytwo/id in mode 2
> reading 24 bytes
read: salec
actual bytes read: 5

> writing `salec`
successfully wrote 5 bytes

> writing `sales`
errno: 22 Invalid argument

> writing `sale`
errno: 22 Invalid argument

> writing `salec42`
errno: 22 Invalid argument

----------------------------------------------------------------------
>>>>> Testing /sys/kernel/debug/fortytwo/jiffies
>>> opening /sys/kernel/debug/fortytwo/jiffies in mode 0
> reading 5 bytes
read: 42947
actual bytes read: 5

> reading 3 bytes
read: 453
actual bytes read: 3

> reading 11 bytes
read: 07

actual bytes read: 3

>>> opening /sys/kernel/debug/fortytwo/jiffies in mode 0
> reading 42 bytes
read: 4294745307

actual bytes read: 11

----------------------------------------------------------------------
>>>>> Testing /sys/kernel/debug/fortytwo/foo
>>> opening /sys/kernel/debug/fortytwo/foo in mode 0
> reading 5 bytes
read: salec
actual bytes read: 5

> reading 3 bytes
read: sal
actual bytes read: 3

> reading 2 bytes
read: es
actual bytes read: 2

> reading 24 bytes
read: salesalec42
actual bytes read: 11

----------------------------------------------------------------------
>>>>> Testing /sys/kernel/debug/fortytwo/foo (root required to write)
>>> opening /sys/kernel/debug/fortytwo/foo in mode 2
Error: Permission denied
----------------------------------------------------------------------
>>>>> Testing /sys/kernel/debug/fortytwo/foo
>>> opening /sys/kernel/debug/fortytwo/foo in mode 0
> reading 5 bytes
read: salec
actual bytes read: 5

> reading 3 bytes
read: sal
actual bytes read: 3

> reading 2 bytes
read: es
actual bytes read: 2

> reading 24 bytes
read: salesalec42
actual bytes read: 11

----------------------------------------------------------------------
>>>>> Permissions:
/sys/kernel/debug/fortytwo/id      : -rw-rw-rw-
/sys/kernel/debug/fortytwo/jiffies : -r--r--r--
/sys/kernel/debug/fortytwo/foo     : -rw-r--r--
